---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchExtension
source: html/874afe6e-4cc5-79a9-e13c-5c122ec60a5b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeNotchExtension Property

"Notch Extension":

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeNotchExtension { get; }
```